// import '../pagetypes.dart';

// const pageMap = {
//   '/ChildReanimation': Page(
//     title: "Сердечно-легочная реанимация у детей",
//     text:
//         """Алгоритм базовой слр у детей по рекомендациям Европейского совета по реаниматологии (ERC) 2015 года

// 1. Потеря сознания, отсутствие дыхания, нет реакции на боль
// 2. Обеспечить проходимость дыхательных путей: Тройной прием Сафара, прием Геймлиха, санация ВДП
// 3. Нормальное дыхание не восстановилось?
// 4. 5 поддерживающих вдохов
// 5. Отсутствуют признаки *жизни*?
// 6. Компрессии грудной клетки (в количестве согласно возрасту)
// 7. Продолжить СЛР с соотношением ЗМС и ИВЛ согласно возрасту. Перейти к расширенной СЛР

// При проведении ЗМС у детей следует добиваться глубины компрессий не менее 1/3 от поперечного сечения грудной клетки.
// Компрессии грудной клетки по возрасту:""",
//     menu: {
//       "Новорожденный": "/ChildReanimation/Newborn",
//       "Младше 7 лет": "/ChildReanimation/7",
//       "7-14 лет": "/ChildReanimation/14",
//       "Старше 14 лет": "/ChildReanimation/Older",
//     },
//   ),
//   '/ChildReanimation/Newborn': Page(
//     title: "Сердечно-легочная реанимация у детей",
//     text: """Частота ЗМС в 1 мин: 120
// Глубина компрессий: 3.0см
// Частота дыхания: 40
// Соотношение ЗМС и ИВЛ: 3:1""",
//   ),
//   '/ChildReanimation/7': Page(
//     title: "Сердечно-легочная реанимация у детей",
//     text: """Частота ЗМС в 1 мин: 100
// Глубина компрессий: 4.0см
// Частота дыхания: 20
// Соотношение ЗМС и ИВЛ: 15:2""",
//   ),
//   '/ChildReanimation/14': Page(
//     title: "Сердечно-легочная реанимация у детей",
//     text: """Частота ЗМС в 1 мин: 100
// Глубина компрессий: 5.0см
// Частота дыхания: 16-20
// Соотношение ЗМС и ИВЛ: 15:2""",
//   ),
//   '/ChildReanimation/Older': Page(
//     title: "Сердечно-легочная реанимация у детей",
//     text: """Частота ЗМС в 1 мин: 100
// Глубина компрессий: 5.0-6.0см
// Частота дыхания: 12-14
// Соотношение ЗМС и ИВЛ: 30:2""",
//   ),
//   '/ChildReanimation/Info': Page(
//     title: "Сердечно-легочная реанимация у детей",
//     text:
//         """Танатогенез у детей чаще всего связан с нарастанием дыхательной недостаточности, реже – с первичной кардиальной смертью, как у взрослых. Поэтому базовая сердечно-легочная реанимация детей отличается от реанимации взрослых: выполняется порядок реанимационных мероприятий, предложенный Питером Сафаром (АВС).""",
//   ),
// };
