// import '../pagetypes.dart';

// const pageMap = {
//   '/Likhoradka': Page(
//       title: "Лихорадка",
//       text: "Нарушение периферийного обращения",
//       menu: {
//         "Да": "/Likhoradka/BadCirculation",
//         "Нет": "/Likhoradka/OkCirculation",
//       }),
//   //
//   '/Likhoradka/OkCirculation':
//       Page(title: "Лихорадка", text: """Возраст до 3-х месяцев, больше 60 лет.
// Сопутствующие заболевания, предрасположенность к судорогам.
// Индивидуальная плохая переносимость лихорадки.""", menu: {
//     "Да": "/Likhoradka/OkCirculation/38",
//     "Нет": "/Likhoradka/OkCirculation/39",
//   }),
//   //
//   '/Likhoradka/OkCirculation/38':
//       Page(title: "Лихорадка", text: "t выше 38,0°С", menu: {
//     "Да": "/Likhoradka/Treatment",
//     "Нет": "/Likhoradka/NoTreatment",
//   }),
//   //
//   '/Likhoradka/OkCirculation/39':
//       Page(title: "Лихорадка", text: "t выше 39,0°С", menu: {
//     "Да": "/Likhoradka/Treatment",
//     "Нет": "/Likhoradka/NoTreatment",
//   }),
//   //
//   '/Likhoradka/NoTreatment':
//       Page(title: "Лихорадка", text: """Температуру не снижать.
// Частое обильное питье.""", menu: {
//     "На главную": "/",
//   }),
//   //
//   '/Likhoradka/Treatment': Page(
//       title: "Лихорадка",
//       text: """Физические методы охлаждения, адекватная регидратация.
// Парацетамол 10-15 мг/кг (но не более 500 мг)
// или метамизол натрия 10-15 мг/кг (но не более 500 мг).""",
//       menu: {
//         "На главную": "/",
//       }),
//   //
//   '/Likhoradka/BadCirculation': Page(
//     title: "Лихорадка",
//     text: """Метамизол натрия 10-15 мг/кг (но не более 500 мг).
// Хлоропирамин 0,5-2 мг/кг (но не более 20 мг) с 1 мес.
// Дротаверин 1 мг/кг (но не более 80 мг) с 3 лет.
// Физические методы охлаждения не применять !!!""",
//   ),
//   //
//   '/Likhoradka/Info': Page(
//       title: "Лихорадка",
//       text: """Лихорадка – защитно-приспособительная неспецифическая реакция
// организма, возникающая при действии пирогенов и проявляющаяся
// повышением температуры тела вследствие перестройки центров
// терморегуляции на новый уровень функционирования.
// Показания для госпитализации:
// − ректальная температура выше 38,3°С без каких-либо очевидных причин у
// ребенка младше 1 месяца;
// − ректальная температура выше 39,4°С без каких-либо очевидных причин у
// ребенка младше 6 месяцев;
// − пациенты пожилого и старческого возраста;
// − наличие геморрагической сыпи, даже при единичных элементах;
// − если лихорадка сопровождается судорогами, отеками, гематурией;
// − пациенты с тяжелой сопутствующей патологией;
// − отсутствие эффекта от лечения на дому;
// − невозможность соблюдения противоэпидемического режима по месту
// жительства;
// − подозрение на инфекцию, на которые распространяются международные
// медико-санитарные правила (2005 г.).
// Лихорадка – защитно-приспособительная неспецифическая реакция
// организма, возникающая при действии пирогенов и проявляющаяся
// повышением температуры тела вследствие перестройки центров
// терморегуляции на новый уровень функционирования.
// Показания для госпитализации:
// − ректальная температура выше 38,3°С без каких-либо очевидных причин у
// ребенка младше 1 месяца;
// − ректальная температура выше 39,4°С без каких-либо очевидных причин у
// ребенка младше 6 месяцев;
// − пациенты пожилого и старческого возраста;
// − наличие геморрагической сыпи, даже при единичных элементах;
// − если лихорадка сопровождается судорогами, отеками, гематурией;
// − пациенты с тяжелой сопутствующей патологией;
// − отсутствие эффекта от лечения на дому;
// − невозможность соблюдения противоэпидемического режима по месту
// жительства;
// − подозрение на инфекцию, на которые распространяются международные
// медико-санитарные правила (2005 г.).""")
// };
